import os
import sys
import time
def clear():
	os.system("clear")

def lo(word):
    nahid = ["[\x1b[1;91m■\x1b[0m□□□□□□□□□]","[\x1b[1;92m■■\x1b[0m□□□□□□□□]", "[\x1b[1;93m■■■\x1b[0m□□□□□□□]", "[\x1b[1;94m■■■■\x1b[0m□□□□□□]", "[\x1b[1;95m■■■■■\x1b[0m□□□□□]", "[\x1b[1;96m■■■■■■\x1b[0m□□□□]", "[\x1b[1;97m■■■■■■■\x1b[0m□□□]", "[\x1b[1;98m■■■■■■■■\x1b[0m□□]", "[\x1b[1;99m■■■■■■■■■\x1b[0m□]", "[\x1b[1;910m■■■■■■■■■■\x1b[0m]"]
    for i in range(5):
        for x in range(len(nahid)):
            sys.stdout.write(('\r{}{}').format(str(word), nahid[x]))
            time.sleep(0.1)
            sys.stdout.flush()


def logo():
	print(""" 
\033[1;34m██╗  ██╗\033[1;31m███████╗\033[1;35m██████╗  \033[1;36m██████╗ \033[1;33m███╗   ██╗
\033[1;34m██║  ██║\033[1;31m██╔════╝\033[1;35m██╔══██╗\033[1;36m██╔═══██╗\033[1;33m████╗  ██║
\033[1;34m███████║\033[1;31m█████╗  \033[1;35m██████╔╝\033[1;36m██║   ██║\033[1;33m██╔██╗ ██║
\033[1;34m██╔══██║\033[1;31m██╔══╝  \033[1;35m██╔══██╗\033[1;36m██║   ██║\033[1;33m██║╚██╗██║
\033[1;34m██║  ██║\033[1;31m███████╗\033[1;35m██║  ██║╚\033[1;36m██████╔╝\033[1;33m██║ ╚████║
\033[1;34m╚═╝  ╚═╝\033[1;31m╚══════╝\033[1;35m╚═╝  ╚═╝ \033[1;36m╚═════╝ \033[1;33m╚═╝  ╚═══╝
                                           
\033[41m\033[1;37m👅[👿👿]   [HERON]    [CYBER]   [👿👿]👅\x1b[0m
\033[1;32m┌───────────────────────────────────────┐
\033[1;32m│ [✓] AUTHOR   :  HERON\033[1;32m[99]             │
\033[1;32m│ [✓] GITHUB   :  \033[1;32mheroncyber99          │
\033[1;32m│ [✓] WHATSAPP :  01722183463           │
\033[1;32m│ [✓] POWER    :  \033[1;31mCYBER99               \033[1;32m│
\033[1;32m└───────────────────────────────────────┘ """)
clear()

lo("              SYSTEM STARTING ")
clear()
logo()
print()
print()
print("\033[1;32m[1]start ")
hi = input('choice:')
if hi in ['1','01']:
	os.system("https://www.xnxx.tv/video-9lcnt31/massage_sex_vedios")
clear()
logo()
print("\033[1;32m[1]start ")
hi = input('choice:')
if hi in ['1','01']:
	os.system("xdg-open https://www.xnxx.tv/video-9lcnt31/massage_sex_vedios")
